In [1]:
# Author: Wish 

import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([['13 trmiielter hof koln 54296','','Germany'],['13 trmiielter hof trier 54296','','Germany'],['14 hoffen hof hamburg 85472','','Germany'],['23 xena state drive frankfurt 74561','','Germany'],['23 xena state drive darmstadt 74561','','Germany']], columns = ('address','city','country'))

In [3]:
df

                               address city  country
0         13 trmiielter hof koln 54296       Germany
1        13 trmiielter hof trier 54296       Germany
2          14 hoffen hof hamburg 85472       Germany
3  23 xena state drive frankfurt 74561       Germany
4  23 xena state drive darmstadt 74561       Germany

In [4]:
lst1 = ['dortmund','trier','koln','hamburg','darmstadt','haffen'] # extract and make list of cities that are already there.

In [5]:
lst1

['dortmund', 'trier', 'koln', 'hamburg', 'darmstadt', 'haffen']

In [25]:
blank = [] # create empty list so that you enter cities found in address to data frame column.
count = 0      # simply initialize for comfort. 
#temp = 0

In [26]:
df

                               address city  country
0         13 trmiielter hof koln 54296       Germany
1        13 trmiielter hof trier 54296       Germany
2          14 hoffen hof hamburg 85472       Germany
3  23 xena state drive frankfurt 74561       Germany
4  23 xena state drive darmstadt 74561       Germany

In [27]:
for i in df[['address']]:
    #for j in lst1:
    adr = df[i]  #column name temporary
    str1 = adr.values # gets all values of column seprately str1 is just a dummy column created in for loop to iterate the actual address colprint(str1)
    for i in range (0, len(str1)):
        for j in range (0, len(lst1)):
            val = str1[i].find(lst1[j])
            if ( val >= 0):
                blank.append(lst1[j])
            if ( val < 0  ):
                pass

In [33]:
lst1 # cities database list

['dortmund', 'trier', 'koln', 'hamburg', 'darmstadt', 'haffen']

In [31]:
blank  # extracting cities existing in cities database to data frame address values.

['koln', 'trier', 'hamburg', 'darmstadt']

In [32]:
df #see your data frame. Note you need a complete list of cities that are in the data frame to actuall match each.
# once you have all cities just add the extracted cities list in the existing data frame that has all addresses to get
# seprate column as cities that match with each address.

                               address city  country
0         13 trmiielter hof koln 54296       Germany
1        13 trmiielter hof trier 54296       Germany
2          14 hoffen hof hamburg 85472       Germany
3  23 xena state drive frankfurt 74561       Germany
4  23 xena state drive darmstadt 74561       Germany